{
  "restaurants": [
    {
      "restaurant_name": "Bistro Delight",
      "rating": 4.5,
      "price_range": "$$",
      "open_now": true,
      "cuisine": "Italian",
      "categories": ["Italian", "European"],
      "photos": [
        "https://images.unsplash.com/photo-1517248135467-4c7edcad34c4",
        "https://images.unsplash.com/photo-1552566626-52f8b828add9"
      ],
      "id": "bistro-delight-001",
      "location": {
        "address": "123 Delicious St, Food City",
        "latitude": 40.712776,
        "longitude": -74.005974
      },
      "reviews": [
        {
          "id": "review-001",
          "name": "John Doe",
          "rating": 5,
          "text": "The food at this restaurant is absolutely fantastic! Every dish was prepared to perfection, with rich, bold flavors and fresh ingredients that you could truly taste in every bite. The pasta was perfectly al dente, and the sauce for the carbonara was creamy and flavorful without being too heavy. The service was impeccable, with the staff attentive but not intrusive. The ambiance created by the warm lighting and rustic decor transported me straight to Italy. The wine selection was extensive, and the sommelier's recommendations perfectly complemented our meals. The tiramisu for dessert was arguably the best I've ever had - perfectly balanced and not too sweet. The cozy atmosphere made for a perfect dining experience, and I've already made reservations to come back next week. This place truly understands Italian cuisine and hospitality.",
          "profile_path": "https://randomuser.me/api/portraits/men/1.jpg",
          "pictures": [
            "https://images.unsplash.com/photo-1546549032-9571cd6b27df",
            "https://images.unsplash.com/photo-1551183053-bf91a1d81141"
          ]
        },
        {
          "id": "review-002",
          "name": "Jane Smith",
          "rating": 4,
          "text": "I had a truly memorable dining experience at Bistro Delight that exceeded my expectations in many ways. The food was absolutely delicious, especially the appetizers, which were bursting with flavor and showcased the chef's creativity. The margherita pizza was a standout - light and fresh, with the perfect balance of mozzarella and basil on a wonderfully crispy crust. The only minor downside was that the portion sizes were a bit smaller than expected, though the quality of the ingredients and preparation more than made up for it. The restaurant's atmosphere was energetic but still maintained a cozy feel, though it did get a bit noisy during peak hours. The staff was knowledgeable and friendly, though the service was slightly slower than ideal during the busy dinner rush. The fresh bread basket with herb-infused olive oil was a delightful touch that kept us satisfied while waiting. The wine list was impressive, and the house red was excellent value for money. Despite the few small issues, this is definitely a great spot for a casual night out or special occasion.",
          "profile_path": "https://randomuser.me/api/portraits/women/1.jpg",
          "pictures": [
            "https://images.unsplash.com/photo-1605478371310-a9f1e96b4ff4"
          ]
        }
      ],
      "menu": {
        "food": [
          {
            "name": "Spaghetti Carbonara",
            "description": "Classic Italian pasta made with eggs, cheese, pancetta, and pepper.",
            "price": "$12.99"
          },
          {
            "name": "Margherita Pizza",
            "description": "Traditional pizza with fresh tomatoes, mozzarella, basil, and olive oil.",
            "price": "$10.99"
          }
        ],
        "drinks": [
          {
            "name": "Chianti Red Wine",
            "description": "A full-bodied red wine from Tuscany.",
            "price": "$8.50"
          },
          {
            "name": "Espresso",
            "description": "Strong and rich coffee brewed from freshly ground beans.",
            "price": "$2.00"
          }
        ]
      }
    },
    {
      "restaurant_name": "Sahara Grill",
      "rating": 4.6,
      "price_range": "$$",
      "open_now": true,
      "cuisine": "Middle Eastern",
      "categories": ["Middle Eastern", "Mediterranean"],
      "photos": [
        "https://media.thepeakmagazine.com.sg/public/2024/07/revolver-grill-dubai.jpg?compress=true&quality=80&w=1080&dpr=1.3"
      ],
      "id": "sahara-grill-002",
      "location": {
        "address": "2045 Mirage St, Oasis City",
        "latitude": 32.080187,
        "longitude": 34.870618
      },
      "reviews": [
        {
          "id": "review-001",
          "name": "Zayd Al-Farsi",
          "rating": 5,
          "text": "Sahara Grill offers an unforgettable taste of the Middle East. The flavors are rich and authentic, with dishes like the lamb shawarma and falafel that are simply out of this world. The shawarma is tender, juicy, and packed with spices, while the falafel is crispy on the outside and perfectly moist inside. The hummus is velvety smooth and the baba ghanoush is smoky and rich. The restaurant's ambiance is warm and inviting, with traditional Middle Eastern decor, and the service is exceptional—friendly and efficient. It's also a great spot for a casual yet flavorful meal with friends or family. I highly recommend their freshly made pita bread that complements every dish perfectly.",
          "profile_path": "https://randomuser.me/api/portraits/men/5.jpg",
          "pictures": [
            "https://media-cdn.tripadvisor.com/media/photo-s/17/1c/e7/ff/one-of-the-bestrestaurant.jpg"
          ]
        },
        {
          "id": "review-002",
          "name": "Layla Nour",
          "rating": 4,
          "text": "If you're looking for a taste of the Middle East, Sahara Grill is the place to go. The menu offers a variety of traditional dishes, all bursting with bold, fragrant flavors. I tried the grilled chicken kebab, which was perfectly marinated and served with a side of tabbouleh, and it did not disappoint. The pita bread is freshly baked, and the tahini sauce is smooth and well-balanced. The only downside is the size of the restaurant, which can get crowded during peak hours, but the food is well worth the wait. The staff is attentive and knowledgeable about the menu, and the overall atmosphere is vibrant and welcoming.",
          "profile_path": "https://randomuser.me/api/portraits/women/2.jpg",
          "pictures": [
            "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/09/3f/d2/df/maza.jpg?w=600&h=400&s=1"
          ]
        }
      ],
      "menu": {
        "food": [
          {
            "name": "Lamb Shawarma",
            "description": "Tender slices of lamb marinated with spices, served in a pita with garlic sauce, pickles, and fries.",
            "price": "$12.99"
          },
          {
            "name": "Falafel Plate",
            "description": "Crispy falafel served with hummus, tabbouleh, and freshly baked pita bread.",
            "price": "$9.99"
          },
          {
            "name": "Grilled Chicken Kebab",
            "description": "Juicy chicken marinated in Middle Eastern spices, grilled to perfection, served with rice or vegetables.",
            "price": "$13.49"
          }
        ],
        "drinks": [
          {
            "name": "Mint Lemonade",
            "description": "A refreshing blend of fresh lemon and mint, served chilled.",
            "price": "$4.50"
          },
          {
            "name": "Turkish Coffee",
            "description": "Strong, traditional Turkish coffee served with a side of sweet treats.",
            "price": "$3.00"
          }
        ]
      }
    },
    {
      "restaurant_name": "Pasta Perfection",
      "rating": 4.6,
      "price_range": "$$",
      "open_now": false,
      "cuisine": "Italian",
      "categories": ["Italian", "European"],
      "photos": [
        "https://images.pexels.com/photos/461198/pexels-photo-461198.jpeg",
        "https://images.pexels.com/photos/2653532/pexels-photo-2653532.jpeg"
      ],
      "id": "pasta-perfection-001",
      "location": {
        "address": "123 Pasta St, Flavor Town",
        "latitude": 40.743776,
        "longitude": -74.040974
      },
      "reviews": [
        {
          "id": "review-001",
          "name": "John K",
          "rating": 5,
          "text": "Pasta Perfection truly lives up to its name. The Fettuccine Alfredo was creamy, and the Marinara was tangy and fresh. The service was impeccable and the ambiance was cozy.",
          "profile_path": "https://randomuser.me/api/portraits/men/1.jpg",
          "pictures": [
            "https://images.pexels.com/photos/1640776/pexels-photo-1640776.jpeg",
            "https://www.allrecipes.com/thmb/JPQcpUKRsPXhUZm0H-XZUpjrp8w=/0x512/filters:no_upscale():max_bytes(150000):strip_icc()/67700_RichPastaforthePoorKitchen_ddmfs_4x3_2284-220302ec8328442096df370dede357d7.jpg"
          ]
        }
      ],
      "menu": {
        "food": [
          {
            "name": "Spaghetti Marinara",
            "description": "Fresh pasta served with a tangy tomato sauce and basil.",
            "price": "$12.50"
          },
          {
            "name": "Fettuccine Alfredo",
            "description": "Creamy Alfredo sauce with a hint of garlic.",
            "price": "$14.00"
          }
        ],
        "drinks": [
          {
            "name": "Pinot Grigio",
            "description": "Crisp white wine from Italy",
            "price": "$9.00"
          },
          {
            "name": "Cappuccino",
            "description": "Creamy coffee with milk froth",
            "price": "$3.50"
          }
        ]
      }
    },
    {
      "restaurant_name": "Curry Kingdom",
      "rating": 4.8,
      "price_range": "$$$",
      "open_now": false,
      "cuisine": "Indian",
      "categories": ["Indian", "Asian", "Curry"],
      "photos": [
        "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/23/61/3b/c9/curry-kingdom-front.jpg?w=900&h=500&s=1"
      ],
      "id": "curry-kingdom-001",
      "location": {
        "address": "456 Spice Road, Curry Town",
        "latitude": 40.753776,
        "longitude": -74.055974
      },
      "reviews": [
        {
          "id": "review-003",
          "name": "Raj M",
          "rating": 5,
          "text": "Curry Kingdom offers the most authentic Indian curry I've had outside of India. The chicken tikka masala was flavorful, and the naan was freshly baked. The ambiance was cozy and perfect for a family dinner.",
          "profile_path": "https://randomuser.me/api/portraits/men/1.jpg",
          "pictures": [
            "https://hips.hearstapps.com/hmg-prod/images/chicken-curry-index-65a1629f3c1e7.jpg?crop=0.8885082084225553xw:1xh;center,top&resize=1200:*",
            "https://kitchenofdebjani.com/wp-content/uploads/2023/04/easy-indian-chicken-curry-Recipe-for-beginners-Debjanir-rannaghar.jpg"
          ]
        },
        {
          "id": "review-004",
          "name": "Priya S",
          "rating": 4,
          "text": "I loved the curry, especially the butter chicken! It was rich, creamy, and aromatic. The garlic naan was also fantastic. A great spot for Indian cuisine lovers.",
          "profile_path": "https://randomuser.me/api/portraits/women/2.jpg",
          "pictures": [
            "https://www.allrecipes.com/thmb/SdMAwswRKAApm4UTxhePo8Nub7I=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/15156-Easy-Chicken-Curry-ddmds-4x3-08a906694cc044bfbbd8b303cdf9cc8c.jpg"
          ]
        }
      ],
      "menu": {
        "food": [
          {
            "name": "Chicken Tikka Masala",
            "description": "Tender chicken pieces in a creamy, spiced tomato sauce.",
            "price": "$15.99"
          },
          {
            "name": "Butter Chicken",
            "description": "A mild and creamy chicken curry with a rich tomato base.",
            "price": "$16.50"
          }
        ],
        "drinks": [
          {
            "name": "Mango Lassi",
            "description": "A sweet, yogurt-based drink with mango puree.",
            "price": "$5.00"
          },
          {
            "name": "Chai Tea",
            "description": "Traditional Indian spiced tea.",
            "price": "$2.50"
          }
        ]
      }
    },
    {
      "restaurant_name": "Sushi Palace",
      "rating": 4.7,
      "price_range": "$$$",
      "open_now": true,
      "cuisine": "Japanese",
      "categories": ["Japanese", "Sushi", "Asian"],
      "photos": [
        "https://images.unsplash.com/photo-1579871494447-9811cf80d66c",
        "https://images.unsplash.com/photo-1611143669185-af224c5e3252"
      ],
      "id": "sushi-palace-002",
      "location": {
        "address": "456 Wasabi Ave, Food City",
        "latitude": 40.722776,
        "longitude": -74.015974
      },
      "reviews": [
        {
          "id": "review-003",
          "name": "Mike Wilson",
          "rating": 5,
          "text": "Sushi Palace has completely redefined my expectations for Japanese cuisine. The freshest, most delectable sushi I've ever experienced. The Rainbow Roll was an absolute masterpiece - gorgeously presented and topped with the most tender, flavorful sashimi that practically melted in my mouth. The rice was perfectly seasoned and maintained ideal temperature throughout the meal. The chef's attention to detail was evident in every dish, from the precisely cut fish to the artistic plating. The omakase experience was particularly impressive, featuring seasonal specialties that showcased the chef's creativity and expertise. The wasabi is freshly grated, and the pickled ginger is house-made - these small details really elevate the entire experience. The ambiance strikes the perfect balance between modern elegance and traditional Japanese aesthetics. The service was exceptional - knowledgeable, attentive, and timing was impeccable. The sake selection is extensive, and the staff's recommendations were spot-on. Even their green tea was noteworthy, served at the perfect temperature with unlimited refills.",
          "profile_path": "https://randomuser.me/api/portraits/men/2.jpg",
          "pictures": [
            "https://images.unsplash.com/photo-1553621042-f6e147245754",
            "https://images.unsplash.com/photo-1617196034796-73dfa7b1fd56"
          ]
        },
        {
          "id": "review-004",
          "name": "Sarah Chen",
          "rating": 4,
          "text": "Sushi Palace truly lives up to its reputation as one of the city's premier Japanese dining destinations. The quality of their sushi is simply outstanding, with each piece showcasing the kitchen's commitment to excellence. The fish is consistently fresh and expertly prepared, with the rice perfectly seasoned and maintained at ideal temperature. I particularly enjoyed their signature rolls, which balance creativity with tradition. The atmosphere is sophisticated yet welcoming, with thoughtful design elements that create a serene dining environment. The service, while generally excellent, did have some timing issues during peak hours, but the staff's knowledge and friendliness made up for any delays. The green tea service was exceptional, and I appreciated the extensive sake list with helpful descriptions. The quality of ingredients is evident in every dish, from the smallest appetizer to the most elaborate sushi platter. The chef's selection of sashimi was particularly impressive, featuring some rare cuts that you don't often find elsewhere. While the prices are on the higher side, the quality justifies the cost. The only suggestion for improvement would be the waiting time for tables during peak hours - a reservation system upgrade might help streamline this process.",
          "profile_path": "https://randomuser.me/api/portraits/women/2.jpg",
          "pictures": [
            "https://images.unsplash.com/photo-1579584425555-c3ce17fd4351"
          ]
        }
      ],
      "menu": {
        "food": [
          {
            "name": "Rainbow Roll",
            "description": "California roll topped with assorted sashimi.",
            "price": "$16.99"
          },
          {
            "name": "Nigiri Set",
            "description": "Chef's selection of fresh nigiri sushi.",
            "price": "$24.99"
          }
        ],
        "drinks": [
          {
            "name": "Sake",
            "description": "Premium Japanese rice wine.",
            "price": "$12.00"
          },
          {
            "name": "Green Tea",
            "description": "Traditional Japanese green tea.",
            "price": "$3.00"
          }
        ]
      }
    },
    {
      "restaurant_name": "Taco Fiesta",
      "rating": 4.3,
      "price_range": "$",
      "open_now": true,
      "cuisine": "Mexican",
      "categories": ["Mexican", "Latin American"],
      "photos": [
        "https://images.unsplash.com/photo-1551504734-5ee1c4a1479b",
        "https://images.unsplash.com/photo-1565299543923-37dd37887442"
      ],
      "id": "taco-fiesta-003",
      "location": {
        "address": "789 Salsa Blvd, Food City",
        "latitude": 40.732776,
        "longitude": -74.025974
      },
      "reviews": [
        {
          "id": "review-005",
          "name": "Carlos Rodriguez",
          "rating": 4,
          "text": "Taco Fiesta delivers an authentic Mexican street food experience that transported me straight to the vibrant streets of Mexico City. The street tacos are absolutely phenomenal - each variety offering its own unique blend of flavors and textures. The carne asada is perfectly seasoned and grilled to perfection, while the al pastor has that authentic flavor that comes from proper marination and cooking techniques. The salsa bar is impressive, featuring six different homemade salsas ranging from mild to intensely spicy, and the guacamole is fresh and perfectly seasoned. The corn tortillas are made fresh throughout the day, which really makes a difference in quality. The atmosphere is lively and colorful, with traditional Mexican music adding to the authentic feel. The service team is friendly and efficient, though during peak hours the wait times can stretch a bit long. The complimentary chips and salsa are always fresh and replenished quickly. Their horchata is house-made and perfectly balanced - not too sweet and wonderfully refreshing. While the space can get quite busy and noisy, especially during peak hours, the energy is part of what makes this place special. The value for money is exceptional, with generous portions at very reasonable prices.",
          "profile_path": "https://randomuser.me/api/portraits/men/3.jpg",
          "pictures": [
            "https://images.unsplash.com/photo-1551504734-5ee1c4a1479b",
            "https://images.unsplash.com/photo-1565299585323-38d6b0865b47"
          ]
        },
        {
          "id": "review-006",
          "name": "Emily Brown",
          "rating": 5,
          "text": "Taco Fiesta has absolutely mastered the art of authentic Mexican street food! Every visit is a celebration of flavors that transport you straight to Mexico. The tacos are simply outstanding - each one is a perfect combination of fresh ingredients and bold flavors. The tortillas are made fresh daily, and you can really taste the difference. The carne asada tacos were cooked to perfection, with the meat tender and flavorful, while the fish tacos were light and crispy with the perfect amount of slaw and crema. The salsa bar is a highlight, offering an impressive variety of house-made salsas ranging from mild to wildly spicy - the roasted tomato salsa is particularly amazing. The elote (Mexican street corn) is an absolute must-try, perfectly grilled and generously coated with mayo, cotija cheese, chili powder, and lime. The horchata is freshly made and perfectly balanced, while their margaritas are strong and refreshing without being overly sweet. The atmosphere is vibrant and lively, with colorful decorations and Latin music creating the perfect backdrop for a casual dining experience. The service is friendly and efficient, with staff always ready to make recommendations or explain different dishes. Even during busy times, the quality and portions remain consistent. The prices are incredibly reasonable for the quality and quantity of food you receive. This place truly understands authentic Mexican cuisine and delivers it with passion and expertise.",
          "profile_path": "https://randomuser.me/api/portraits/women/3.jpg",
          "pictures": [
            "https://images.unsplash.com/photo-1552332386-f8dd00dc2f85"
          ]
        }
      ],
      "menu": {
        "food": [
          {
            "name": "Street Tacos",
            "description": "Three authentic street-style tacos with choice of meat.",
            "price": "$8.99"
          },
          {
            "name": "Enchiladas",
            "description": "Three cheese enchiladas with red sauce.",
            "price": "$11.99"
          }
        ],
        "drinks": [
          {
            "name": "Margarita",
            "description": "Classic lime margarita with salt rim.",
            "price": "$7.00"
          },
          {
            "name": "Horchata",
            "description": "Traditional rice drink with cinnamon.",
            "price": "$3.50"
          }
        ]
      }
    },
    {
      "restaurant_name": "Golden Dragon",
      "rating": 4.6,
      "price_range": "$$",
      "open_now": true,
      "cuisine": "Chinese",
      "categories": ["Chinese", "Asian", "Dim Sum"],
      "photos": [
        "https://images.unsplash.com/photo-1526318896980-cf78c088247c",
        "https://images.unsplash.com/photo-1563245372-f21724e3856d"
      ],

      "id": "golden-dragon-001",
      "location": {
        "address": "234 Pearl St, Food City",
        "latitude": 40.742776,
        "longitude": -74.035974
      },
      "reviews": [
        {
          "id": "review-007",
          "name": "Lisa Wong",
          "rating": 5,
          "text": "Golden Dragon offers the most authentic dim sum experience I've found outside of Hong Kong. The variety and quality of their dim sum selections are simply outstanding. Every dish from the har gow to the siu mai was masterfully prepared with delicate wrappers and flavorful fillings. The har gow had perfectly translucent wrappers with plump, sweet shrimp filling, while the siu mai were juicy and well-seasoned. The char siu bao were exceptionally fluffy with a generous filling of barbecue pork. Their selection of specialty teas is impressive, with knowledgeable staff who can guide you to the perfect pairing for your meal. The weekend dim sum service is especially vibrant, with traditional cart service that adds to the authentic experience. While the wait times can be long during peak hours, particularly on weekends, the quality of the food makes it worthwhile. The dining room is spacious and well-maintained, with round tables perfect for family-style dining. The service is efficient and attentive, though during busy times it can be a bit hectic. Their XO sauce is house-made and absolutely incredible - worth purchasing a jar to take home. The price point is very reasonable considering the quality and portion sizes. Even their simplest dishes, like the congee and Chinese greens, are prepared with care and attention to detail.",
          "profile_path": "https://randomuser.me/api/portraits/women/4.jpg",
          "pictures": [
            "https://images.unsplash.com/photo-1563245372-f21724e3856d",
            "https://images.unsplash.com/photo-1455619452474-d2be8b1e70cd"
          ]
        },
        {
          "id": "review-008",
          "name": "Robert Chen",
          "rating": 4,
          "text": "Golden Dragon stands as a beacon of authentic Chinese cuisine in our city. The dim sum selection is impressive and rivals what you'd find in major Chinatowns across the country. The Peking duck is a standout dish that requires advance ordering - the skin is perfectly crispy, and the meat is tender and flavorful, served with house-made pancakes that are thin and delicate. The dim sum options are extensive and consistently well-prepared, with standout items including the cheung fun (rice noodle rolls) and egg tarts that are served fresh from the oven. The restaurant maintains high standards across both traditional and modern Chinese dishes. The seafood offerings are particularly noteworthy, with the live fish options always fresh and expertly prepared. The wine list is surprisingly good for a Chinese restaurant, and they also offer a solid selection of premium Chinese teas. The service could be more attentive during peak hours, but the staff is knowledgeable about the menu and happy to make recommendations. The atmosphere is traditional with modern touches, and the round tables with lazy Susans are perfect for family-style dining. While some might find the prices slightly high for Chinese cuisine, the quality of ingredients and preparation justifies the cost. The restaurant can get quite busy, especially during dim sum hours, but they manage the flow well with their number system.",
          "profile_path": "https://randomuser.me/api/portraits/men/4.jpg",
          "pictures": [
            "https://images.unsplash.com/photo-1541696432-82c6da8ce7bf"
          ]
        }
      ],
      "menu": {
        "food": [
          {
            "name": "Peking Duck",
            "description": "Whole roasted duck served with pancakes and hoisin sauce",
            "price": "$45.99"
          },
          {
            "name": "Dim Sum Platter",
            "description": "Assorted dim sum including har gow, siu mai, and BBQ pork buns",
            "price": "$28.99"
          }
        ],
        "drinks": [
          {
            "name": "Jasmine Tea",
            "description": "Premium jasmine green tea",
            "price": "$3.00"
          },
          {
            "name": "Chinese Beer",
            "description": "Imported Tsingtao beer",
            "price": "$6.00"
          }
        ]
      }
    },
    {
      "restaurant_name": "Le Petit Bistrot",
      "rating": 4.8,
      "price_range": "$$$",
      "open_now": true,
      "cuisine": "French",
      "categories": ["French", "European", "Fine Dining"],
      "photos": [
        "https://images.unsplash.com/photo-1550966871-3ed3cdb5ed0c",
        "https://images.unsplash.com/photo-1414235077428-338989a2e8c0"
      ],
      "id": "le-petit-bistrot-002",
      "location": {
        "address": "567 Rue Belle, Food City",
        "latitude": 40.752776,
        "longitude": -74.045974
      },
      "reviews": [
        {
          "id": "review-009",
          "name": "Marie Dubois",
          "rating": 5,
          "text": "An absolutely magnificent dining experience!...",
          "profile_path": "https://randomuser.me/api/portraits/women/5.jpg",
          "pictures": [
            "https://images.unsplash.com/photo-1600891964092-4316c288032e",
            "https://images.unsplash.com/photo-1534766555764-ce878a5e3a2b"
          ]
        },
        {
          "id": "review-010",
          "name": "James Peterson",
          "rating": 5,
          "text": "Outstanding French cuisine...",
          "profile_path": "https://randomuser.me/api/portraits/men/5.jpg",
          "pictures": [
            "https://images.unsplash.com/photo-1514326640560-7d063ef2aed5"
          ]
        }
      ],
      "menu": {
        "food": [
          {
            "name": "Coq au Vin",
            "description": "Classic French chicken braised in wine with mushrooms and pearl onions",
            "price": "$32.99"
          },
          {
            "name": "Beef Bourguignon",
            "description": "Slow-cooked beef in red wine sauce with vegetables",
            "price": "$36.99"
          }
        ],
        "drinks": [
          {
            "name": "French Red Wine",
            "description": "House-selected Bordeaux",
            "price": "$12.00"
          },
          {
            "name": "French Press Coffee",
            "description": "Premium French roast coffee",
            "price": "$4.50"
          }
        ]
      }
    },
    {
      "restaurant_name": "Burger Bliss",
      "rating": 4.4,
      "price_range": "$$",
      "open_now": true,
      "cuisine": "American",
      "categories": ["Burgers", "American", "Fast Casual"],
      "photos": [
        "https://images.unsplash.com/photo-1568901346375-23c9450c58cd?w=500",
        "https://images.unsplash.com/photo-1551782450-a2132b4ba21d?w=500"
      ],
      "id": "burger-bliss-011",
      "location": {
        "address": "123 Burger Lane, Food City",
        "latitude": 40.842776,
        "longitude": -74.135974
      },
      "reviews": [
        {
          "id": "review-027",
          "name": "Bob Miller",
          "rating": 5,
          "text": "Best burgers in town! The patties are perfectly seasoned and cooked to order. The truffle fries are absolutely addictive. Great craft beer selection too!",
          "profile_path": "https://i.pravatar.cc/150?img=1",
          "pictures": [
            "https://images.unsplash.com/photo-1550317138-10000687a72b?w=500",
            "https://images.unsplash.com/photo-1551782450-17144efb9c50?w=500"
          ]
        },
        {
          "id": "review-028",
          "name": "Alice Cooper",
          "rating": 4,
          "text": "Great quality burgers with interesting topping combinations. The milkshakes are thick and delicious. Service can be slow during peak hours.",
          "profile_path": "https://i.pravatar.cc/150?img=2",
          "pictures": [
            "https://images.unsplash.com/photo-1550547660-d9450f859349?w=500"
          ]
        }
      ],
      "menu": {
        "food": [
          {
            "name": "Classic Cheeseburger",
            "description": "1/3 lb Angus beef patty with aged cheddar and special sauce",
            "price": "$12.99"
          },
          {
            "name": "Truffle Fries",
            "description": "Hand-cut fries with truffle oil and parmesan",
            "price": "$6.99"
          }
        ],
        "drinks": [
          {
            "name": "Craft Beer",
            "description": "Rotating selection of local brews",
            "price": "$7.00"
          },
          {
            "name": "Classic Milkshake",
            "description": "Hand-spun with premium ice cream",
            "price": "$5.99"
          }
        ]
      }
    },
    {
      "restaurant_name": "Sushi Zen",
      "rating": 4.8,
      "price_range": "$$$",
      "open_now": true,
      "cuisine": "Japanese",
      "categories": ["Sushi", "Japanese", "Fine Dining"],
      "photos": [
        "https://images.unsplash.com/photo-1553621042-f6e147245754?w=500",
        "https://images.unsplash.com/photo-1579871494447-9811cf80d66c?w=500"
      ],
      "id": "sushi-zen-012",
      "location": {
        "address": "456 Sakura Street, Food City",
        "latitude": 40.852776,
        "longitude": -74.145974
      },
      "reviews": [
        {
          "id": "review-029",
          "name": "Yuki Tanaka",
          "rating": 5,
          "text": "Exceptional sushi experience! The fish is incredibly fresh, and the presentation is beautiful. The omakase is worth every penny.",
          "profile_path": "https://i.pravatar.cc/150?img=3",
          "pictures": [
            "https://images.unsplash.com/photo-1558985250-27a406d64cb3?w=500",
            "https://images.unsplash.com/photo-1559339352-11d035aa65de?w=500"
          ]
        },
        {
          "id": "review-030",
          "name": "Michael Chang",
          "rating": 5,
          "text": "Top-notch sushi restaurant. The rice is perfectly seasoned and the fish quality is outstanding. Great sake selection too!",
          "profile_path": "https://i.pravatar.cc/150?img=4",
          "pictures": [
            "https://images.unsplash.com/photo-1553621042-f6e147245754?w=500"
          ]
        }
      ],
      "menu": {
        "food": [
          {
            "name": "Omakase",
            "description": "Chef's selection of premium sushi and sashimi",
            "price": "$120.00"
          },
          {
            "name": "Dragon Roll",
            "description": "Eel and cucumber topped with avocado",
            "price": "$18.99"
          }
        ],
        "drinks": [
          {
            "name": "Premium Sake",
            "description": "Daiginjo grade sake",
            "price": "$25.00"
          },
          {
            "name": "Green Tea",
            "description": "Premium Japanese sencha",
            "price": "$4.00"
          }
        ]
      }
    },
    {
      "restaurant_name": "Tapas & Wine",
      "rating": 4.6,
      "price_range": "$$$",
      "open_now": true,
      "cuisine": "Spanish",
      "categories": ["Spanish", "Tapas", "Wine Bar"],
      "photos": [
        "https://images.unsplash.com/photo-1515443961218-a51367888e4b?w=500",
        "https://images.unsplash.com/photo-1517254797898-ee448f71b67c?w=500"
      ],
      "id": "tapas-wine-013",
      "location": {
        "address": "789 Barcelona Way, Food City",
        "latitude": 40.862776,
        "longitude": -74.155974
      },
      "reviews": [
        {
          "id": "review-031",
          "name": "Carmen Rodriguez",
          "rating": 5,
          "text": "Authentic Spanish tapas in a vibrant atmosphere! The patatas bravas and gambas al ajillo are must-tries. Excellent wine selection.",
          "profile_path": "https://i.pravatar.cc/150?img=5",
          "pictures": [
            "https://images.unsplash.com/photo-1484980972926-edee96e0960d?w=500",
            "https://images.unsplash.com/photo-1529692236671-f1f6cf9683ba?w=500"
          ]
        },
        {
          "id": "review-032",
          "name": "David Wilson",
          "rating": 4,
          "text": "Great spot for sharing small plates and enjoying Spanish wines. The atmosphere is perfect for date night.",
          "profile_path": "https://i.pravatar.cc/150?img=6",
          "pictures": [
            "https://images.unsplash.com/photo-1517254797898-ee448f71b67c?w=500"
          ]
        }
      ],
      "menu": {
        "food": [
          {
            "name": "Patatas Bravas",
            "description": "Crispy potatoes with spicy tomato sauce",
            "price": "$8.99"
          },
          {
            "name": "Gambas al Ajillo",
            "description": "Garlic shrimp in olive oil",
            "price": "$14.99"
          }
        ],
        "drinks": [
          {
            "name": "Spanish Red Wine",
            "description": "Rioja reserva",
            "price": "$12.00"
          },
          {
            "name": "Sangria",
            "description": "House-made with fresh fruit",
            "price": "$9.00"
          }
        ]
      }
    },
    {
      "restaurant_name": "Pho Delicious",
      "rating": 4.5,
      "price_range": "$",
      "open_now": true,
      "cuisine": "Vietnamese",
      "categories": ["Vietnamese", "Asian", "Soup"],
      "photos": [
        "https://images.unsplash.com/photo-1582878826629-29b7ad1cdc43?w=500",
        "https://images.unsplash.com/photo-1565557623262-b51c2513a641?w=500"
      ],
      "id": "pho-delicious-014",
      "location": {
        "address": "321 Saigon Street, Food City",
        "latitude": 40.872776,
        "longitude": -74.165974
      },
      "reviews": [
        {
          "id": "review-033",
          "name": "Tran Nguyen",
          "rating": 5,
          "text": "Best pho in the city! The broth is rich and flavorful, and they don't skimp on the meat. Great selection of Vietnamese coffee too!",
          "profile_path": "https://i.pravatar.cc/150?img=7",
          "pictures": [
            "https://images.unsplash.com/photo-1582878826629-29b7ad1cdc43?w=500",
            "https://images.unsplash.com/photo-1573806439793-82aa612294b3?w=500"
          ]
        },
        {
          "id": "review-034",
          "name": "Lucy Wang",
          "rating": 4,
          "text": "Authentic Vietnamese flavors. The spring rolls are fresh and the pho broth is delicious. Fast service and reasonable prices.",
          "profile_path": "https://i.pravatar.cc/150?img=8",
          "pictures": [
            "https://images.unsplash.com/photo-1565557623262-b51c2513a641?w=500"
          ]
        }
      ],
      "menu": {
        "food": [
          {
            "name": "Special Pho",
            "description": "Rice noodles in beef broth with various cuts of beef",
            "price": "$12.99"
          },
          {
            "name": "Spring Rolls",
            "description": "Fresh rolls with shrimp and pork",
            "price": "$6.99"
          }
        ],
        "drinks": [
          {
            "name": "Vietnamese Coffee",
            "description": "Strong coffee with condensed milk",
            "price": "$4.50"
          },
          {
            "name": "Fresh Coconut",
            "description": "Young coconut juice",
            "price": "$5.00"
          }
        ]
      }
    }
  ]
}
